Revit 2024 API
BuiltInFailures.GeneralFailures.EnterNonNegativeValue Property
 Enter a non-negative value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId EnterNonNegativeValue { get; }
Visual Basic
Public Shared ReadOnly Property EnterNonNegativeValue As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ EnterNonNegativeValue {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GeneralFailures Class
Autodesk.Revit.DB Namespace